2024-01-07-ReviewUnison/basics.org
#+TITLE: Beginner's Guide to Unison
#+AUTHOR: Dou Meishi
#+DATE: [2024-01-06]
#+FILETAGS: tool

[[https://github.com/bcpierce00/unison][Unison]] is a file-synchronization tool for Unix and Windows. It allows two replicas of a collection of files and
directories to be stored on different hosts (or different disks on the same host), modified separately, and then
brought up to date by propagating the changes in each replica to the other.

*Note:* This review is a short summary of [[https://raw.githubusercontent.com/bcpierce00/unison/documentation/unison-manual.pdf][the official manual]].
Please use version 2.52 or newer to avoid version interoperability issues.

* A Demo

Unison can be used with either of two user interfaces: a textual interface and a graphical interface.

Let's consider a simple scenario and see how to synchronize two directories on a single machine.

0. [@0] install Unison. Basically, we need only two executable binary files, =unison= and =unison-gui=,
   downloaded from the proper release tarball in [[https://github.com/bcpierce00/unison][its github repository]].

1. Set up a =work= directory and a =mirror= direcotry for our illustration

  #+BEGIN_SRC bash
    mkdir work
    touch work/a work/b
    mkdir work/d
    touch work/d/f
    cp -r work mirror
  #+END_SRC

2. Try synchronizing =work= and =mirror=. Since they are identical, synchronizing them won’t propagate
   any changes, but Unison will remember the current state of both directories so that it will be able to tell
   next time what has changed by typing =unison work mirror=.

   - /textual interface:/ you should see a message notifying you that all the files are actually equal and then get returned to
     the command line, and you may also get a warning message for creating /archives/ (the private data structure used by Unison)
     as this is the first run of Unison.

   - /graphical interface:/ You should get a big empty window with a message at the bottom notifying you /everything is up-to-date/.

3. Make some changes in =work= and =mirror=

  #+BEGIN_SRC bash
    rm work/a
    echo "Hello" > work/b
    echo "Hello" > mirror/b
    date > mirror/c
    echo "Hi there" > work/d/h
    echo "Hello there" > mirror/d/h
  #+END_SRC

4. Try synchronizing =work= and =mirror= again by typing =unison work mirror=.

   Let us elaborate the behaviors of the textual interface in this case.

   0. [@0] Unison will display /only/ the files that are different and ask for actions one by one.
       If a file has been changed in the same way and remain identical in both directories,
       Unison will simply note the file is up-to-date and nothing will be shown. So we expect three
       changes to be decided: the absent file of =a= in =work=, the new file =c= in =mirror=
       and the conflicting changes on =d/h=.

   1. Unison will notify the creation of =c= in =mirror= and prompt a line like

      #+BEGIN_EXAMPLE
         <--- new file   c  [f]
      #+END_EXAMPLE

      We can follow Unison’s recommendation, press =f= or =[ENTER]= at the prompt.
      Or we can simply ignore this file and leave both replicas alone by pressing =/=.
      Pressing =?= for a list of possible responses and their meanings.
      See also [[https://stackoverflow.com/questions/64587602/how-does-one-use-the-matching-condition-commands-for-the-unison-cli][this question]] for explanation on the key =L= and matching conditions.

   2. Similarly, Unison will notify the delete of =a= in work and prompt a line like

      #+BEGIN_EXAMPLE
deleted  --->            a  [f]
      #+END_EXAMPLE

   3. For conflicting changes on =d/h=, Unison will prompt a line like

      #+BEGIN_EXAMPLE
new file <-?-> new file   d/h  []
      #+END_EXAMPLE

   4. Suppose we skip the file =d/h= and accept changes on file =a= and =c=, Unison
       will briefly summarize the actions it is supposed to do and asks for
       confirmation

      #+BEGIN_EXAMPLE
2 items will be synced, 1 skipped
0 B to be synced from work to mirror
32 B to be synced from mirror to work

Proceed with propagating updates? []
      #+END_EXAMPLE

   5. Finally, if we confirm then Unison will apply changes and output logs of the process.

   The usage of the graphical interface is similar. The main window shows all the files that have been modified.
   To override a default action (or to select an action in the case when there is no default), first select the file
   by clicking on its name, then press the desired action key metioned before.
   When you are satisfied with the propagation of changes as shown in the main window,
   click the /Go/ button to set them in motion.

