2024-01-07-ReviewUnison/basics.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://dou-meishi.github.io/org-blog/rss.xml"
      title="RSS feed for https://dou-meishi.github.io/org-blog/">
<title>A Beginner's Guide to Unison</title>
<meta name="author" content="Dou Meishi">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="google-site-verification" content="_Ly4i8BW_CWeGaFdsQgJ2xN-yOkGpSDnLw8LitvkEsw" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
<link rel="stylesheet" type="text/css" href="https://dou-meishi.github.io/orgcss/dou-new-org.css"/>
</head>
<body>
<div id="preamble" class="status"><div class="header">
  <div class="sitelinks">
    <a href="https://dou-meishi.github.io/org-blog/index.html">Home</a>
    |
    <a href="https://dou-meishi.github.io/org-blog/archive.html">All Posts</a>
  </div>
</div>
</div>
<div id="content">
<div class="post-date">06 Jan 2024</div><h1 class="post-title"><a href="https://dou-meishi.github.io/org-blog/2024-01-07-ReviewUnison/basics.html">A Beginner's Guide to Unison</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb896952">A Demo</a></li>
<li><a href="#orgda5dc63">Basic Concepts</a></li>
<li><a href="#orgf145269">Typical Usage</a></li>
<li><a href="#orgd353dec">Caveats and Shortcomings</a></li>
<li><a href="#org4d5fc79">Going Further</a></li>
</ul>
</div>
</nav>
<p>
<a href="https://github.com/bcpierce00/unison">Unison</a> is a file-synchronization tool for Unix and Windows. It allows two replicas of a collection of files and
directories to be stored on different hosts (or different disks on the same host), modified separately, and then
brought up to date by propagating the changes in each replica to the other.
</p>

<p>
<b>Note:</b> This review is a short summary of <a href="https://raw.githubusercontent.com/bcpierce00/unison/documentation/unison-manual.pdf">the official manual</a>.
Please use version 2.52 or newer to avoid version interoperability issues.
</p>
<div id="outline-container-orgb896952" class="outline-2">
<h2 id="orgb896952"><a href="#orgb896952">A Demo</a></h2>
<div class="outline-text-2" id="text-orgb896952">
<p>
Unison can be used with either of two user interfaces: a textual interface and a graphical interface.
</p>

<p>
Let's consider a simple scenario and see how to synchronize two directories on a single machine.
</p>

<ol class="org-ol">
<li value="0">install Unison. Basically, we need only two executable binary files, <code>unison</code> and <code>unison-gui</code>,
downloaded from the proper release tarball in <a href="https://github.com/bcpierce00/unison">its github repository</a>.</li>

<li><p>
Set up a <code>work</code> directory and a <code>mirror</code> direcotry for our illustration
</p>

<div class="org-src-container">
<pre class="src src-bash">    mkdir work
    touch work/a work/b
    mkdir work/d
    touch work/d/f
    cp -r work mirror
</pre>
</div></li>

<li>Try synchronizing <code>work</code> and <code>mirror</code>. Since they are identical, synchronizing them won’t propagate
any changes, but Unison will remember the current state of both directories so that it will be able to tell
next time what has changed by typing <code>unison work mirror</code>.

<ul class="org-ul">
<li><i>textual interface:</i> you should see a message notifying you that all the files are actually equal and then get returned to
the command line, and you may also get a warning message for creating <i>archives</i> (the private data structure used by Unison)
as this is the first run of Unison.</li>

<li><i>graphical interface:</i> You should get a big empty window with a message at the bottom notifying you <i>everything is up-to-date</i>.</li>
</ul></li>

<li><p>
Make some changes in <code>work</code> and <code>mirror</code>
</p>

<div class="org-src-container">
<pre class="src src-bash">    rm work/a
    <span style="color: #657b83; font-weight: bold;">echo</span> <span style="color: #2aa198;">"Hello"</span> &gt; work/b
    <span style="color: #657b83; font-weight: bold;">echo</span> <span style="color: #2aa198;">"Hello"</span> &gt; mirror/b
    date &gt; mirror/c
    <span style="color: #657b83; font-weight: bold;">echo</span> <span style="color: #2aa198;">"Hi there"</span> &gt; work/d/h
    <span style="color: #657b83; font-weight: bold;">echo</span> <span style="color: #2aa198;">"Hello there"</span> &gt; mirror/d/h
</pre>
</div></li>

<li><p>
Try synchronizing <code>work</code> and <code>mirror</code> again by typing <code>unison work mirror</code>.
</p>

<p>
Let us elaborate the behaviors of the textual interface in this case.
</p>

<ol class="org-ol">
<li value="0">Unison will display <i>only</i> the files that are different and ask for actions one by one.
If a file has been changed in the same way and remain identical in both directories,
Unison will simply note the file is up-to-date and nothing will be shown. So we expect three
changes to be decided: the absent file of <code>a</code> in <code>work</code>, the new file <code>c</code> in <code>mirror</code>
and the conflicting changes on <code>d/h</code>.</li>

<li><p>
Unison will notify the creation of <code>c</code> in <code>mirror</code> and prompt a line like
</p>

<pre class="example" id="org971a46a">
         &lt;--- new file   c  [f]
</pre>

<p>
We can follow Unison’s recommendation, press <code>f</code> or <code>[ENTER]</code> at the prompt.
Or we can simply ignore this file and leave both replicas alone by pressing <code>/</code>.
Pressing <code>?</code> for a list of possible responses and their meanings.
See also <a href="https://stackoverflow.com/questions/64587602/how-does-one-use-the-matching-condition-commands-for-the-unison-cli">this question</a> for explanation on the key <code>L</code> and matching conditions.
</p></li>

<li><p>
Similarly, Unison will notify the delete of <code>a</code> in work and prompt a line like
</p>

<pre class="example" id="orgc22d174">
deleted  ---&gt;            a  [f]
</pre></li>

<li><p>
For conflicting changes on <code>d/h</code>, Unison will prompt a line like
</p>

<pre class="example" id="orgd097e74">
new file &lt;-?-&gt; new file   d/h  []
</pre></li>

<li><p>
Suppose we skip the file <code>d/h</code> and accept changes on file <code>a</code> and <code>c</code>, Unison
will briefly summarize the actions it is supposed to do and asks for
confirmation
</p>

<pre class="example" id="orgd200948">
2 items will be synced, 1 skipped
0 B to be synced from work to mirror
32 B to be synced from mirror to work

Proceed with propagating updates? []
</pre></li>

<li>Finally, if we confirm then Unison will apply changes and output logs of the process.</li>
</ol>

<p>
The usage of the graphical interface is similar. The main window shows all the files that have been modified.
To override a default action (or to select an action in the case when there is no default), first select the file
by clicking on its name, then press the desired action key metioned before.
When you are satisfied with the propagation of changes as shown in the main window,
click the <i>Go</i> button to set them in motion.
</p></li>
</ol>
</div>
</div>
