2024-01-07-ReviewUnison/basics.org
* Basic Concepts

Below is a short summary of [[https://raw.githubusercontent.com/bcpierce00/unison/documentation/unison-manual.pdf][the official manual]].

1. /Roots./ A replica’s root tells Unison where to find a set of files to be synchronized, either on the local machine or on
   a remote host. The pattern of the root is =[protocol:]//[user@][host][:port][path]=.
   When =path= is given without any protocol prefix, the protocol is assumed to be =file=.
   Other possible protocol arguments include =ssh= and =socket=.
   If =path= is a relative path, then it actually specifies a local root relative to the directory where Unison is started.

2. /Paths./ A /path/ refers to a point within a set of files being synchronized; it is specified relative to the root of the
   replica. Formally, a path is just a sequence of names, separated by =/=.
   The empty path (i.e., the empty sequence of names) denotes the whole replica.
   Unison displays the empty path as =[root]=.

3. /Descendants./   If =p= is a path and =q= is a path beginning with =p=, then =q= is said to be a /descendant/ of =p=.
   Thus, each path is also a descendant of itself.

4. /Contents./ The /contents/ of a path =p= in a particular replica could be a file, a directory, a symbolic link, or absent (if p
   does not refer to anything at all in that replica). More specifically:

   1. If =p= refers to an ordinary file, then the contents of p are the actual contents of this file (a string of
      bytes) plus the current permission bits of the file.

   2. If =p= refers to a symbolic link, then the contents of =p= are just the string specifying where the link points.

   3. If =p= refers to a directory, then the contents of p are just the token /DIRECTORY/ plus the current
      permission bits of the directory.

   4. If =p= does not refer to anything in this replica, then the contents of =p= are the token /ABSENT/.

   Unison keeps a record (named /archives/) of the contents of each path after each successful synchronization
   of that path (i.e., it remembers the contents at the last moment when they were the same in the two replicas).

5. /Update./ A path is /updated/ (in some replica) if its current contents are different from its contents the
   last time it was successfully synchronized.

6. /Conflicts./ A path is said to be /conflicting/ if the following conditions /all/ hold:

   1. it has been updated in one replica,

   2. any of its descendants has been updated in the other replica,

   3. its contents in the two replicas are not identical.

7. /Reconciliation./ Unison operates in several distinct stages:

   1. On each host, it compares its archive file (which records the state of each path in the replica when it
      was last synchronized) with the current contents of the replica, to determine which paths have been updated.

   2. It checks for /false conflicts/  — paths that have been updated on both replicas, but whose current
      values are identical. These paths are silently marked as synchronized in the archive files in both replicas.

   3. It displays all the updated paths to the user. For updates that do not conflict, it suggests a default
      action (propagating the new contents from the updated replica to the other). Conflicting updates are
      just displayed. The user is given an opportunity to examine the current state of affairs, change the
      default actions for nonconflicting updates, and choose actions for conflicting updates.

   4. It performs the selected actions, one at a time. Each action is performed by first transferring the new
      contents to a temporary file on the receiving host, then atomically moving them into place.

   5. It updates its archive files to reflect the new state of the replicas.

8. /Invariants./ Unison is careful to protect both its internal state and the state of the replicas at every point in this
   process. Specifically, the following guarantees are enforced:

   1. At every moment, each path in each replica has either

      1. its original contents (i.e., no change at all has been made to this path), or

      2. its correct final contents (i.e., the value that the user expected to be propagated from the other replica).

   2. At every moment, the information stored on disk about Unison’s private state can be either

      1. unchanged, or
      2. updated to reflect those paths that have been successfully synchronized.

   If Unison gets interrupted during ensuring those guarantees, some manual cleanup may be required.
   In this case, a file called DANGER.README will be left in the =.unison= directory,
   containing information about the operation that was interrupted.
   The next time you try to run Unison, it will notice this file and warn you about it.

   If Unison is interrupted, it may sometimes leave temporary working files (with suffix =.tmp=) in the replicas.
   It is safe to delete these files. Also, if the backups flag is set, Unison will leave around old versions of files
   that it overwrites, with names like =file.0.unison.bak=. These can be deleted safely when they are no longer wanted.

   If Unison finds that its archive files have been deleted (or that the archive format has changed and they
   cannot be read, or that they don’t exist because this is the first run of Unison on these particular roots),
   it takes a conservative approach: it behaves as though the replicas had both been completely empty at the
   point of the last synchronization. Thus, It is also safe to delete those archive files on both replicas.
   The next time Unison runs, it will assume that all the files it sees in the replicas are new.

* Typical Usage

Once you are comfortable with the basic operation of Unison, you may find yourself wanting to use it
regularly to synchronize your commonly used files. There are several possible ways of going about this:

1. Synchronize your whole home directory, using the /Ignore facility/ to
   avoid synchronizing particular directories and files.

2. Synchronize your whole home directory, but tell Unison to synchronize only some of
   the files and subdirectories within it. This can be accomplished by specifying the =-path=
   arguments in your /profile/.

3. Create another directory called =shared= (or =current=, or whatever) on each host,
   and put all the files you want to synchronize into this directory. Tell Unison to synchronize =shared=
   among different hosts.

4. Create another directory called =shared= (or =current=, or whatever) on each host,
   and put /links/ to all the files you want to synchronize into this directory. Use the =follow= preference
   to make Unison treat these links as transparent.

Unison is designed for synchronizing pairs of replicas. However, it is possible to use it to keep larger groups
of machines in sync by performing multiple pairwise synchronizations.
If you need to do this, the most reliable way to set things up is to organize the machines into a /star topology/
with one machine designated as the /hub/ and the rest as /spokes/ and with each spoke machine
synchronizing only with the hub.

