2024-01-07-ReviewUnison/basics.html
<div id="outline-container-orgda5dc63" class="outline-2">
<h2 id="orgda5dc63"><a href="#orgda5dc63">Basic Concepts</a></h2>
<div class="outline-text-2" id="text-orgda5dc63">
<p>
Below is a short summary of <a href="https://raw.githubusercontent.com/bcpierce00/unison/documentation/unison-manual.pdf">the official manual</a>.
</p>

<ol class="org-ol">
<li><i>Roots.</i> A replica’s root tells Unison where to find a set of files to be synchronized, either on the local machine or on
a remote host. The pattern of the root is <code>[protocol:]//[user@][host][:port][path]</code>.
When <code>path</code> is given without any protocol prefix, the protocol is assumed to be <code>file</code>.
Other possible protocol arguments include <code>ssh</code> and <code>socket</code>.
If <code>path</code> is a relative path, then it actually specifies a local root relative to the directory where Unison is started.</li>

<li><i>Paths.</i> A <i>path</i> refers to a point within a set of files being synchronized; it is specified relative to the root of the
replica. Formally, a path is just a sequence of names, separated by <code>/</code>.
The empty path (i.e., the empty sequence of names) denotes the whole replica.
Unison displays the empty path as <code>[root]</code>.</li>

<li><i>Descendants.</i>   If <code>p</code> is a path and <code>q</code> is a path beginning with <code>p</code>, then <code>q</code> is said to be a <i>descendant</i> of <code>p</code>.
Thus, each path is also a descendant of itself.</li>

<li><p>
<i>Contents.</i> The <i>contents</i> of a path <code>p</code> in a particular replica could be a file, a directory, a symbolic link, or absent (if p
does not refer to anything at all in that replica). More specifically:
</p>

<ol class="org-ol">
<li>If <code>p</code> refers to an ordinary file, then the contents of p are the actual contents of this file (a string of
bytes) plus the current permission bits of the file.</li>

<li>If <code>p</code> refers to a symbolic link, then the contents of <code>p</code> are just the string specifying where the link points.</li>

<li>If <code>p</code> refers to a directory, then the contents of p are just the token <i>DIRECTORY</i> plus the current
permission bits of the directory.</li>

<li>If <code>p</code> does not refer to anything in this replica, then the contents of <code>p</code> are the token <i>ABSENT</i>.</li>
</ol>

<p>
Unison keeps a record (named <i>archives</i>) of the contents of each path after each successful synchronization
of that path (i.e., it remembers the contents at the last moment when they were the same in the two replicas).
</p></li>

<li><i>Update.</i> A path is <i>updated</i> (in some replica) if its current contents are different from its contents the
last time it was successfully synchronized.</li>

<li><i>Conflicts.</i> A path is said to be <i>conflicting</i> if the following conditions <i>all</i> hold:

<ol class="org-ol">
<li>it has been updated in one replica,</li>

<li>any of its descendants has been updated in the other replica,</li>

<li>its contents in the two replicas are not identical.</li>
</ol></li>

<li><i>Reconciliation.</i> Unison operates in several distinct stages:

<ol class="org-ol">
<li>On each host, it compares its archive file (which records the state of each path in the replica when it
was last synchronized) with the current contents of the replica, to determine which paths have been updated.</li>

<li>It checks for <i>false conflicts</i>  — paths that have been updated on both replicas, but whose current
values are identical. These paths are silently marked as synchronized in the archive files in both replicas.</li>

<li>It displays all the updated paths to the user. For updates that do not conflict, it suggests a default
action (propagating the new contents from the updated replica to the other). Conflicting updates are
just displayed. The user is given an opportunity to examine the current state of affairs, change the
default actions for nonconflicting updates, and choose actions for conflicting updates.</li>

<li>It performs the selected actions, one at a time. Each action is performed by first transferring the new
contents to a temporary file on the receiving host, then atomically moving them into place.</li>

<li>It updates its archive files to reflect the new state of the replicas.</li>
</ol></li>

<li><p>
<i>Invariants.</i> Unison is careful to protect both its internal state and the state of the replicas at every point in this
process. Specifically, the following guarantees are enforced:
</p>

<ol class="org-ol">
<li>At every moment, each path in each replica has either

<ol class="org-ol">
<li>its original contents (i.e., no change at all has been made to this path), or</li>

<li>its correct final contents (i.e., the value that the user expected to be propagated from the other replica).</li>
</ol></li>

<li>At every moment, the information stored on disk about Unison’s private state can be either

<ol class="org-ol">
<li>unchanged, or</li>
<li>updated to reflect those paths that have been successfully synchronized.</li>
</ol></li>
</ol>

<p>
If Unison gets interrupted during ensuring those guarantees, some manual cleanup may be required.
In this case, a file called DANGER.README will be left in the <code>.unison</code> directory,
containing information about the operation that was interrupted.
The next time you try to run Unison, it will notice this file and warn you about it.
</p>

<p>
If Unison is interrupted, it may sometimes leave temporary working files (with suffix <code>.tmp</code>) in the replicas.
It is safe to delete these files. Also, if the backups flag is set, Unison will leave around old versions of files
that it overwrites, with names like <code>file.0.unison.bak</code>. These can be deleted safely when they are no longer wanted.
</p>

<p>
If Unison finds that its archive files have been deleted (or that the archive format has changed and they
cannot be read, or that they don’t exist because this is the first run of Unison on these particular roots),
it takes a conservative approach: it behaves as though the replicas had both been completely empty at the
point of the last synchronization. Thus, It is also safe to delete those archive files on both replicas.
The next time Unison runs, it will assume that all the files it sees in the replicas are new.
</p></li>
</ol>
</div>
</div>
<div id="outline-container-orgf145269" class="outline-2">
<h2 id="orgf145269"><a href="#orgf145269">Typical Usage</a></h2>
<div class="outline-text-2" id="text-orgf145269">
<p>
Once you are comfortable with the basic operation of Unison, you may find yourself wanting to use it
regularly to synchronize your commonly used files. There are several possible ways of going about this:
</p>

<ol class="org-ol">
<li>Synchronize your whole home directory, using the <i>Ignore facility</i> to
avoid synchronizing particular directories and files.</li>

<li>Synchronize your whole home directory, but tell Unison to synchronize only some of
the files and subdirectories within it. This can be accomplished by specifying the <code>-path</code>
arguments in your <i>profile</i>.</li>

<li>Create another directory called <code>shared</code> (or <code>current</code>, or whatever) on each host,
and put all the files you want to synchronize into this directory. Tell Unison to synchronize <code>shared</code>
among different hosts.</li>

<li>Create another directory called <code>shared</code> (or <code>current</code>, or whatever) on each host,
and put <i>links</i> to all the files you want to synchronize into this directory. Use the <code>follow</code> preference
to make Unison treat these links as transparent.</li>
</ol>

<p>
Unison is designed for synchronizing pairs of replicas. However, it is possible to use it to keep larger groups
of machines in sync by performing multiple pairwise synchronizations.
If you need to do this, the most reliable way to set things up is to organize the machines into a <i>star topology</i>
with one machine designated as the <i>hub</i> and the rest as <i>spokes</i> and with each spoke machine
synchronizing only with the hub.
</p>
</div>
</div>
